package project.basetask;

public class TrainMethodsPrimitive {
    //-- создать невозвратный метод printInt, который принимает на вход целое число (int) и печатает в консоль «я получил на вход число » и это число
    //-- создать невозвратный метод printLong, который принимает на вход целое число (long) и печатает в консоль «я получил на вход  длинное число » и это число
    //-- создать невозвратный метод printChar, который принимает на вход символ (char) и печатает в консоль «я получил на вход символ » и это число
    //-- создать невозвратный метод printFloat, который принимает на вход дробное число (float) и печатает в консоль «я получил на вход дробное число » и это число
    //-- создать невозвратный метод printDouble, который принимает на вход дробное число (double) и печатает в консоль «я получил на вход длинное дробное число » и это число
    //-- создать невозвратный метод printShort, который принимает на вход целое число (short) и печатает в консоль «я получил на вход короткое число » и это число
    //-- создать невозвратный метод printByte, который принимает на вход целое число (byte) и печатает в консоль «я получил на вход очень короткое число » и это число
    //-- создать невозвратный метод printBoolean, который принимает на вход булево значение (boolean) и печатает в консоль «я получил на вход булево » и это число
    public void printInt(int a) {
        System.out.println("я получил на вход число " + a);
    }

    public void printLong(long a) {
        System.out.println("я получил на вход длинное число " + a);
    }

    public void printChar(char a) {
        System.out.println("я получил на вход символ " + a);
    }

    public void printFloat(float a) {
        System.out.println("я получил на вход дробное число " + a);
    }

    public void printDouble(double a) {
        System.out.println("я получил на вход длинное дробное число " + a);
    }

    public void printShort(short a) {
        System.out.println("я получил на вход короткое число " + a);
    }

    public void printByte(byte a) {
        System.out.println("я получил на вход очень короткое число " + a);
    }

    public void printBoolean(boolean a) {
        System.out.println("я получил на вход булево " + a);
    }
}
